## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_app_service_virtual_network_swift_connection.app[0] will be created
  + resource "azurerm_app_service_virtual_network_swift_connection" "app" {
      + app_service_id = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.Web/sites/app-private-chatgpt-aydgnqft"
      + id             = (known after apply)
      + subnet_id      = (known after apply)
    }

  # azurerm_cognitive_account.main will be updated in-place
  ~ resource "azurerm_cognitive_account" "main" {
        id                                 = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.CognitiveServices/accounts/oai-private-chatgpt-aydgnqft"
        name                               = "oai-private-chatgpt-aydgnqft"
        tags                               = {}
        # (13 unchanged attributes hidden)

      - network_acls {
          - default_action = "Allow" -> null
          - ip_rules       = [] -> null
        }

        # (1 unchanged block hidden)
    }

  # azurerm_cosmosdb_account.main will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "main" {
        id                                       = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-private-chatgpt-aydgnqft"
      ~ is_virtual_network_filter_enabled        = false -> true
        name                                     = "cosmos-private-chatgpt-aydgnqft"
        tags                                     = {}
        # (26 unchanged attributes hidden)

      + virtual_network_rule {
          + id                                   = (known after apply)
          + ignore_missing_vnet_service_endpoint = false
        }

        # (6 unchanged blocks hidden)
    }

  # azurerm_linux_web_app.main will be updated in-place
  ~ resource "azurerm_linux_web_app" "main" {
        id                                = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.Web/sites/app-private-chatgpt-aydgnqft"
        name                              = "app-private-chatgpt-aydgnqft"
      ~ public_network_access_enabled     = true -> false
        tags                              = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_network_security_group.main[0] will be created
  + resource "azurerm_network_security_group" "main" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-private-chatgpt-aydgnqft"
      + resource_group_name = "rg-private-chatgpt-aydgnqft-networking"
      + security_rule       = (known after apply)
    }

  # azurerm_private_dns_a_record.app[0] will be created
  + resource "azurerm_private_dns_a_record" "app" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "app-private-chatgpt-aydgnqft"
      + records             = (known after apply)
      + resource_group_name = "rg-private-chatgpt-aydgnqft-networking"
      + ttl                 = 300
      + zone_name           = "privatelink.azurewebsites.net"
    }

  # azurerm_private_dns_a_record.cosmos_db[0] will be created
  + resource "azurerm_private_dns_a_record" "cosmos_db" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cosmos-private-chatgpt-aydgnqft"
      + records             = (known after apply)
      + resource_group_name = "rg-private-chatgpt-aydgnqft-networking"
      + ttl                 = 300
      + zone_name           = "privatelink.documents.azure.us"
    }

  # azurerm_private_dns_a_record.key_vault[0] will be created
  + resource "azurerm_private_dns_a_record" "key_vault" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "kvprivatechatgptaydgnqft"
      + records             = (known after apply)
      + resource_group_name = "rg-private-chatgpt-aydgnqft-networking"
      + ttl                 = 300
      + zone_name           = "privatelink.vaultcore.azure.net"
    }

  # azurerm_private_dns_a_record.openai[0] will be created
  + resource "azurerm_private_dns_a_record" "openai" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "oai-private-chatgpt-aydgnqft"
      + records             = (known after apply)
      + resource_group_name = "rg-private-chatgpt-aydgnqft-networking"
      + ttl                 = 300
      + zone_name           = "privatelink.openai.azure.com"
    }

  # azurerm_private_dns_zone.app[0] will be created
  + resource "azurerm_private_dns_zone" "app" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurewebsites.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-private-chatgpt-aydgnqft-networking"
    }

  # azurerm_private_dns_zone.cosmos_db[0] will be created
  + resource "azurerm_private_dns_zone" "cosmos_db" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.documents.azure.us"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-private-chatgpt-aydgnqft-networking"
    }

  # azurerm_private_dns_zone.key_vault[0] will be created
  + resource "azurerm_private_dns_zone" "key_vault" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-private-chatgpt-aydgnqft-networking"
    }

  # azurerm_private_dns_zone.openai[0] will be created
  + resource "azurerm_private_dns_zone" "openai" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.openai.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-private-chatgpt-aydgnqft-networking"
    }

  # azurerm_private_dns_zone_virtual_network_link.app[0] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "app" {
      + id                    = (known after apply)
      + name                  = "vnet-private-chatgpt-aydgnqft-link-to-privatelink-azurewebsites-net"
      + private_dns_zone_name = "privatelink.azurewebsites.net"
      + registration_enabled  = false
      + resource_group_name   = "rg-private-chatgpt-aydgnqft-networking"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.cosmos_db[0] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "cosmos_db" {
      + id                    = (known after apply)
      + name                  = "vnet-private-chatgpt-aydgnqft-link-to-privatelink-documents-azure-us"
      + private_dns_zone_name = "privatelink.documents.azure.us"
      + registration_enabled  = false
      + resource_group_name   = "rg-private-chatgpt-aydgnqft-networking"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.key_vault[0] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "key_vault" {
      + id                    = (known after apply)
      + name                  = "vnet-private-chatgpt-aydgnqft-link-to-privatelink-vaultcore-azure-net"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "rg-private-chatgpt-aydgnqft-networking"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.openai[0] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "openai" {
      + id                    = (known after apply)
      + name                  = "vnet-private-chatgpt-aydgnqft-link-to-privatelink-openai-azure-com"
      + private_dns_zone_name = "privatelink.openai.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "rg-private-chatgpt-aydgnqft-networking"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_endpoint.app[0] will be created
  + resource "azurerm_private_endpoint" "app" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "pep-app-private-chatgpt-aydgnqft"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-private-chatgpt-aydgnqft-networking"
      + subnet_id                = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "psc-app-private-chatgpt-aydgnqft"
          + private_connection_resource_id = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.Web/sites/app-private-chatgpt-aydgnqft"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # azurerm_private_endpoint.cosmos_db[0] will be created
  + resource "azurerm_private_endpoint" "cosmos_db" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "pep-cosmosdb-private-chatgpt-aydgnqft"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-private-chatgpt-aydgnqft-networking"
      + subnet_id                = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "psc-cosmosdb-private-chatgpt-aydgnqft"
          + private_connection_resource_id = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-private-chatgpt-aydgnqft"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sql",
            ]
        }
    }

  # azurerm_private_endpoint.key_vault[0] will be created
  + resource "azurerm_private_endpoint" "key_vault" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "pep-key-vault-private-chatgpt-aydgnqft"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-private-chatgpt-aydgnqft-networking"
      + subnet_id                = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "psc-key-vault-private-chatgpt-aydgnqft"
          + private_connection_resource_id = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.KeyVault/vaults/kvprivatechatgptaydgnqft"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # azurerm_private_endpoint.openai[0] will be created
  + resource "azurerm_private_endpoint" "openai" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "pep-openai-private-chatgpt-aydgnqft"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-private-chatgpt-aydgnqft-networking"
      + subnet_id                = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "psc-openai-private-chatgpt-aydgnqft"
          + private_connection_resource_id = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.CognitiveServices/accounts/oai-private-chatgpt-aydgnqft"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "account",
            ]
        }
    }

  # azurerm_subnet.app_services[0] will be created
  + resource "azurerm_subnet" "app_services" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-private-chatgpt-aydgnqft-app-services"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-private-chatgpt-aydgnqft-networking"
      + virtual_network_name                           = "vnet-private-chatgpt-aydgnqft"

      + delegation {
          + name = "app-services"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # azurerm_subnet.private_endpoints[0] will be created
  + resource "azurerm_subnet" "private_endpoints" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-private-chatgpt-aydgnqft-private-endpoints"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-private-chatgpt-aydgnqft-networking"
      + service_endpoints                              = [
          + "Microsoft.AzureCosmosDB",
        ]
      + virtual_network_name                           = "vnet-private-chatgpt-aydgnqft"
    }

  # azurerm_virtual_network.main[0] will be created
  + resource "azurerm_virtual_network" "main" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = [
          + "10.0.0.4",
          + "10.0.0.5",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "vnet-private-chatgpt-aydgnqft"
      + resource_group_name = "rg-private-chatgpt-aydgnqft-networking"
      + subnet              = (known after apply)
    }

Plan: 21 to add, 3 to change, 0 to destroy.
```
</details>